nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/drivers/spi_TF/SPI_SD_driver.c
/*******************************************************************************
*  本文件为SPI操作SD卡的底层驱动文件
*  包括SPI模块及相关IO的初始化，SPI读写SD卡（写指令，读数据等）
*******************************************************************************/
/* Includes ------------------------------------------------------------------*/
//#include "common.h"
#include "stm32f2xx.h"
#include "SPI_SD_driver.h"
#include "diskio.h"



/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
u8  SD_Type = 0;
/* Private function prototypes -----------------------------------------------*/

/* Private functions ---------------------------------------------------------*/


////////////////////////////////////////////////////////////////////////////////
// 以下是SPI模块的初始化代码，配置成主机模式，访问SD卡
////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************
* Function Name  : SPI_Configuration
* Description    : SPI模块初始化，【包括相关IO口的初始化】
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_Configuration_SPI2(void)
{
    GPIO_InitTypeDef	GPIO_InitStructure;
    SPI_InitTypeDef		SPI_InitStructure;

    /* Enable DF_SPI Periph clock */
    RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOB, ENABLE );
    RCC_APB1PeriphClockCmd( RCC_APB1Periph_SPI2, ENABLE );
    GPIO_PinAFConfig( GPIOB, GPIO_PinSource13, GPIO_AF_SPI2 );
    GPIO_PinAFConfig( GPIOB, GPIO_PinSource14, GPIO_AF_SPI2 );
    GPIO_PinAFConfig( GPIOB, GPIO_PinSource15, GPIO_AF_SPI2 );
    RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOD, ENABLE );

    GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_DOWN;

    /*!< SPI SCK pin configuration */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
    GPIO_Init( GPIOB, &GPIO_InitStructure );

    /*!< SPI MOSI pin configuration */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14;
    GPIO_Init( GPIOB, &GPIO_InitStructure );

    /*!< SPI MISO pin configuration */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
    GPIO_Init( GPIOB, &GPIO_InitStructure );

    //PA4 pin: CS
    GPIO_InitStructure.GPIO_Pin		= GPIO_Pin_4;
    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
    GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_NOPULL;
    GPIO_Init( GPIOA, &GPIO_InitStructure );
    GPIO_SetBits(GPIOA, GPIO_Pin_4);
#if 0
    //PA2: SD卡插入检测（未插入悬空，插入拉低）PA脚内部上拉
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    //////SPI模块配置//////
    //一开始SD初始化阶段，SPI时钟频率必须<400K
    SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256;
    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
    SPI_InitStructure.SPI_CRCPolynomial = 7;
    SPI_Init(SPI1, &SPI_InitStructure);

    SPI_Cmd(SPI1, ENABLE);
#endif
    //////SPI模块配置//////
    //一开始SD初始化阶段，SPI时钟频率必须<400K
    SPI_InitStructure.SPI_Direction			= SPI_Direction_2Lines_FullDuplex;  //SPI_Direction_1Line_Tx;
    SPI_InitStructure.SPI_Mode				= SPI_Mode_Master;
    SPI_InitStructure.SPI_DataSize			= SPI_DataSize_8b;
    SPI_InitStructure.SPI_CPOL				= SPI_CPOL_Low;
    SPI_InitStructure.SPI_CPHA				= SPI_CPHA_1Edge;
    SPI_InitStructure.SPI_NSS				= SPI_NSS_Soft;
    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256;          /* 42M/4=10.5M */
    SPI_InitStructure.SPI_FirstBit			= SPI_FirstBit_MSB;
    SPI_InitStructure.SPI_CRCPolynomial		= 7;

    SPI_I2S_DeInit( SPI2 );
    SPI_Init( SPI2, &SPI_InitStructure );

    /* Enable SPI_MASTER */
    SPI_Cmd( SPI2, ENABLE );
    return;
}

////////////////////////////////////////////////////////////////////////////////
// 以下是SPI模块的初始化代码，配置成主机模式，访问SD卡
////////////////////////////////////////////////////////////////////////////////
/*******************************************************************************
* Function Name  : SPI_Configuration
* Description    : SPI模块初始化，【包括相关IO口的初始化】
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_Configuration(void)
{

    SPI_InitTypeDef		SPI_InitStructure;
    GPIO_InitTypeDef	GPIO_InitStructure;

    RCC_APB2PeriphClockCmd( RCC_APB2Periph_SPI1, ENABLE );

    RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOA, ENABLE );

    GPIO_PinAFConfig( GPIOA, GPIO_PinSource5, GPIO_AF_SPI1 );
    GPIO_PinAFConfig( GPIOA, GPIO_PinSource6, GPIO_AF_SPI1 );
    GPIO_PinAFConfig( GPIOA, GPIO_PinSource7, GPIO_AF_SPI1 );

    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_DOWN;

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
    GPIO_Init( GPIOA, &GPIO_InitStructure );

    GPIO_InitStructure.GPIO_Pin		= GPIO_Pin_4;
    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
    GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_NOPULL;
    GPIO_Init( GPIOA, &GPIO_InitStructure );

    //_card_power_off();
    SD_CS_DISABLE();

    SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_Mode		= SPI_Mode_Master;
    SPI_InitStructure.SPI_DataSize	= SPI_DataSize_8b;
    SPI_InitStructure.SPI_CPOL		= SPI_CPOL_Low;
    SPI_InitStructure.SPI_CPHA		= SPI_CPHA_1Edge;
    //	SPI_InitStructure.SPI_CPOL				= SPI_CPOL_High;
    //	SPI_InitStructure.SPI_CPHA				= SPI_CPHA_2Edge;
    SPI_InitStructure.SPI_NSS				= SPI_NSS_Soft;
    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256;

