nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/drivers/spi_TF/SPI_SD_driver.c
            //初始化指令发送完成，接下来获取OCR信息

            //-----------鉴别SD2.0卡版本开始-----------
            r1 = SD_SendCommand_NoDeassert(CMD58, 0, 0);
            if(r1 != 0x00)
            {
                return r1;  //如果命令没有返回正确应答，直接退出，返回应答
            }
            //读OCR指令发出后，紧接着是4字节的OCR信息
            buff[0] = SPI_ReadWriteByte(0xFF);
            buff[1] = SPI_ReadWriteByte(0xFF);
            buff[2] = SPI_ReadWriteByte(0xFF);
            buff[3] = SPI_ReadWriteByte(0xFF);

            //OCR接收完成，片选置高
            SD_CS_DISABLE();
            SPI_ReadWriteByte(0xFF);

            //检查接收到的OCR中的bit30位（CCS），确定其为SD2.0还是SDHC
            //如果CCS=1：SDHC         CCS=0：SD2.0
            if(buff[0] & 0x40)  //检查CCS
            {
                SD_Type = SD_TYPE_V2HC;  //SDHC
            }
            else
            {
                SD_Type = SD_TYPE_V2;
            }
            OutPrint_HEX("CMD58 ACK", buff, 4);
            rt_kprintf("\r\n  sd_type=%d\r\n", SD_Type);
            //-----------鉴别SD2.0卡版本结束-----------


            //设置SPI为高速模式
            SPI_SetSpeed(1);
        }

    }

    //如果卡片版本信息是v1.0版本的，即r1=0x05，则进行以下初始化
    else
    {
        // rt_kprintf("\r\n  r1 = %d\r\n",r1);
        //设置卡类型为SDV1.0，如果后面检测到为MMC卡，再修改为MMC
        SD_Type = SD_TYPE_V1;

        //如果是V1.0卡，CMD8指令后没有后续数据
        //片选置高，结束本次命令
        SD_CS_DISABLE();
        //多发8个CLK，让SD结束后续操作
        SPI_ReadWriteByte(0xFF);

        //-----------------SD卡、MMC卡初始化开始-----------------

        //发卡初始化指令CMD55+ACMD41
        // 如果有应答，说明是SD卡，且初始化完成
        // 没有回应，说明是MMC卡，额外进行相应初始化
        retry = 0;
        do
        {
            //先发CMD55，应返回0x01；否则出错
            r1 = SD_SendCommand(CMD55, 0, 0);
            if(r1 != 0x01)
            {
                return r1;
            }
            //得到正确响应后，发ACMD41，应得到返回值0x00，否则重试200次
            r1 = SD_SendCommand(ACMD41, 0, 0);
            retry++;
        }
        while((r1 != 0x00) && (retry < 400));
        // 判断是超时还是得到正确回应
        // 若有回应：是SD卡；没有回应：是MMC卡

        //----------MMC卡额外初始化操作开始------------
        if(retry == 400)
        {
            retry = 0;
            //发送MMC卡初始化命令（没有测试）
            do
            {
                r1 = SD_SendCommand(1, 0, 0);
                retry++;
            }
            while((r1 != 0x00) && (retry < 400));
            if(retry == 400)
            {
                return 1;   //MMC卡初始化超时
            }
            //写入卡类型
            SD_Type = SD_TYPE_MMC;
        }
        //----------MMC卡额外初始化操作结束------------

        //设置SPI为高速模式
        SPI_SetSpeed(1);

        SPI_ReadWriteByte(0xFF);

        //禁止CRC校验
        /*
        r1 = SD_SendCommand(CMD59, 0, 0x01);
        if(r1 != 0x00)
        {
            return r1;  //命令错误，返回r1
        }
        */
        //设置Sector Size
        r1 = SD_SendCommand(CMD16, 512, 0xff);
        if(r1 != 0x00)
        {
            return r1;  //命令错误，返回r1
        }
        //-----------------SD卡、MMC卡初始化结束-----------------

    }//SD卡为V1.0版本的初始化结束
    //rt_kprintf("\r\n SD卡类型2 = %d",SD_Type);
    return r1;
}

u8 SD_Init(void)
{
    u16 i;      // 用来循环计数
    u8 r1;      // 存放SD卡的返回值
    u16 retry;  // 用来进行超时计数
    u8 buff[6];

    //如果没有检测到卡插入，直接退出，返回错误标志
    if(!SD_DET())
    {
        //return 99;
        return STA_NODISK;  //  FatFS错误标志：没有插入磁盘
    }

    //SD卡上电
    SD_PWR_ON();
    // 纯延时，等待SD卡上电完成
    for(i = 0; i < 0xf00; i++);

    //先产生>74个脉冲，让SD卡自己初始化完成
    for(i = 0; i < 10; i++)
    {
        SPI_ReadWriteByte(0xFF);
    }

    //-----------------SD卡复位到idle开始-----------------
    //循环连续发送CMD0，直到SD卡返回0x01,进入IDLE状态
    //超时则直接退出
    retry = 0;
    do
    {
        //发送CMD0，让SD卡进入IDLE状态
        r1 = SD_SendCommand(CMD0, 0, 0x95);
        retry++;
    }
    while((r1 != 0x01) && (retry < 200));
    //跳出循环后，检查原因：初始化成功？or 重试超时？
    if(retry == 200)
    {
        rt_kprintf("\r\n  超时返回   1  \r\n");
        return 1;   //超时返回1
    }
    //-----------------SD卡复位到idle结束-----------------
    //获取卡片的SD版本信息
    r1 = SD_SendCommand_NoDeassert(8, 0x1aa, 0x87);
    //rt_kprintf("\r\n SD卡类型1 = %d",r1);
    //下面是V2.0卡的初始化
    //其中需要读取OCR数据，判断是SD2.0还是SD2.0HC卡
    if(r1 == 0x01)
    {

        //V2.0的卡，CMD8命令后会传回4字节的数据，要跳过再结束本命令
        buff[0] = SPI_ReadWriteByte(0xFF);  //should be 0x00
        buff[1] = SPI_ReadWriteByte(0xFF);  //should be 0x00
        buff[2] = SPI_ReadWriteByte(0xFF);  //should be 0x01
        buff[3] = SPI_ReadWriteByte(0xFF);  //should be 0xAA

        SD_CS_DISABLE();
        //the next 8 clocks
        SPI_ReadWriteByte(0xFF);

        //判断该卡是否支持2.7V-3.6V的电压范围
        if(buff[2] == 0x01 && buff[3] == 0xAA)
        {
            //支持电压范围，可以操作
            retry = 0;
            //发卡初始化指令CMD55+ACMD41        使 SD 卡 进入 SPI 模式 ，默认情况下是SD模式
            do
            {
                r1 = SD_SendCommand(CMD55, 0, 0);
                if(r1 != 0x01)
                {
                    return r1;
                }
                r1 = SD_SendCommand(ACMD41, 0x40000000, 0);
                if(retry > 200)
                {
                    return r1;  //超时则返回r1状态
                }
            }
            while(r1 != 0);

            //初始化指令发送完成，接下来获取OCR信息

            //-----------鉴别SD2.0卡版本开始-----------
            r1 = SD_SendCommand_NoDeassert(CMD58, 0, 0);
            if(r1 != 0x00)
            {
                return r1;  //如果命令没有返回正确应答，直接退出，返回应答
            }
            //读OCR指令发出后，紧接着是4字节的OCR信息
            buff[0] = SPI_ReadWriteByte(0xFF);
            buff[1] = SPI_ReadWriteByte(0xFF);
            buff[2] = SPI_ReadWriteByte(0xFF);
            buff[3] = SPI_ReadWriteByte(0xFF);

            //OCR接收完成，片选置高
            SD_CS_DISABLE();
            SPI_ReadWriteByte(0xFF);

            //检查接收到的OCR中的bit30位（CCS），确定其为SD2.0还是SDHC
            //如果CCS=1：SDHC         CCS=0：SD2.0
            if(buff[0] & 0x40)  //检查CCS
            {
                SD_Type = SD_TYPE_V2HC;  //SDHC
            }
            else
            {
                SD_Type = SD_TYPE_V2;
            }
            //-----------鉴别SD2.0卡版本结束-----------


